//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2010, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**     5555 Oakbrook Pkwy, Suite 200, Norcross, GA 30093            **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************

//**********************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//**********************************************************************
// Revision History
// ----------------
// $Log: $
// 
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:	AmiTcgPlatfromDxeString.uni
//
// Description:	String definitions for PPI interface
//
//<AMI_FHDR_END>
//**********************************************************************
/=#

#langdef eng "English"

//
// Begin English Language Strings
//
#string STR_TCG_CONFIGURATION           #language eng  "A configuration change was requested to "
#string STR_TPM 						#language eng  " the TPM"
#string STR_TCG_KEY1          			#language eng  "Press F12 to "
#string STR_TCG_KEY2          			#language eng  "Press F10 to "
#string STR_TCG_WARNING          		#language eng  "WARNING: This request will remove any keys stored in the TPM"
#string STR_TCG_WARNING1          		#language eng  "WARNING: This request will remove any keys stored in the TPM. You will lose all created keys and access to data encrypted by these keys"
#string STR_TCG_WARNING2          		#language eng  "WARNING: Doing so might prevent security applications that rely on the TPM from functioning as expected"
#string STR_TCG_CONFIRAMATION			#language eng  "Press Esc to reject this change request and continue"
#string STR_TCG_ENABLE					#language eng  "enable"
#string STR_TCG_DISABLE					#language eng  "disable"
#string STR_TCG_ACTIVATE				#language eng  "activate"
#string STR_TCG_DEACTIVATE				#language eng  "deactivate"
#string STR_TCG_ALLOW					#language eng  "allow creation of an operator authentication value that permits temporary deactivation of"
#string STR_TCG_DISALLOW				#language eng  "disallow a user to take ownership of"
#string STR_TCG_CLEAR					#language eng  "clear"
#string STR_TCG_NOTCLEAR				#language eng  "???clear"
#string STR_TCG_SETNOPPIPROVISION      		 #language eng  "allow the Operating System to provision the computer's TPM (Trusted Platform Module) without asking for user confirmation in the future."
#string STR_TCG_SETNOPPIPROVISIONACCPET       	 #language eng  "approve future Operating System requests to provision the TPM"
#string STR_TCG_SETNOPPICLEAR           #language eng  "allow the Operating System to clear the computer's TPM (Trusted Platform Module) without asking for user confirmation in the future."
#string STR_TCG_SETNOPPICLEARACCPET       	 #language eng  "approve future Operating System requests to clear the TPM"
#string STR_TCG_NOTE              		#language eng  "This action will turn on the the computer's TPM (Trusted Platform Module)"
#string STR_TCG_NOTE1              		#language eng  "This action will turn off the the computer's TPM (Trusted Platform Module)"
#string STR_TCG_NOTE2              		#language eng  "This action will clear and turn on the the computer's TPM (Trusted Platform Module)"
#string STR_TCG_SETNOPPIMAINTENANCE     #language eng  "allow the Operating System to Maintain the computer's TPM (Trusted Platform Module) without asking for user confirmation in the future."
#string STR_TCG_SETNOPPIMAINTENANCEACCEPT       	 #language eng  "approve future Operating System requests to Maintain the TPM"
#string STR_TCG_BLANK                   #language eng "                                                                                "

//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2010, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**     5555 Oakbrook Pkwy, Suite 200, Norcross, GA 30093            **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************